{
  "resourceType": "ValueSet",
  "id": "oncology-BreastCancerNCategoryVS",
  "text": {
    "status": "generated",
    "div": "<div xmlns=\"http://www.w3.org/1999/xhtml\">\n<p><b>BC BreastCancerNCategoryVS ValueSet</b></p>\n<p>Codes that designate concepts describing breast clinical lymph node categories according to AJCC Cancer Staging Manual 8th Edition.</p>\n</div>"
  },
  "url": "http://hl7.org/fhir/us/breastcancer/ValueSet/oncology-BreastCancerNCategoryVS",
  "identifier": [
    {
      "system": "http://hl7.org/fhir/us/breastcancer",
      "value": "oncology.BreastCancerNCategoryVS"
    }
  ],
  "name": "BreastCancerNCategoryVS",
  "title": "BC BreastCancerNCategoryVS ValueSet",
  "status": "draft",
  "publisher": "The HL7 Cancer Interoperability Group sponsored by Clinical Interoperability Council Work Group (CIC).",
  "contact": [
    {
      "telecom": [
        {
          "system": "url",
          "value": "http://standardhealthrecord.org"
        }
      ]
    }
  ],
  "date": "2018-03-24",
  "description": "Codes that designate concepts describing breast clinical lymph node categories according to AJCC Cancer Staging Manual 8th Edition.",
  "compose": {
    "include": [
      {
        "system": "http://hl7.org/fhir/us/breastcancer/CodeSystem/oncology-BreastCancerNCategoryCS",
        "concept": [
          {
            "code": "cNX",
            "display": "The concept designated by the symbol cNX in Version 8 of AJCC's cancer staging manual, breast chapter."
          },
          {
            "code": "cN0",
            "display": "The concept designated by the symbol cN0 in Version 8 of AJCC's cancer staging manual, breast chapter."
          },
          {
            "code": "cN1",
            "display": "The concept designated by the symbol cN1 in Version 8 of AJCC's cancer staging manual, breast chapter."
          },
          {
            "code": "cN1mi",
            "display": "The concept designated by the symbol cN1mi in Version 8 of AJCC's cancer staging manual, breast chapter."
          },
          {
            "code": "cN2",
            "display": "The concept designated by the symbol cN2 in Version 8 of AJCC's cancer staging manual, breast chapter."
          },
          {
            "code": "cN2a",
            "display": "The concept designated by the symbol cN2a in Version 8 of AJCC's cancer staging manual, breast chapter."
          },
          {
            "code": "cN2b",
            "display": "The concept designated by the symbol cN2b in Version 8 of AJCC's cancer staging manual, breast chapter."
          },
          {
            "code": "cN3",
            "display": "The concept designated by the symbol cN3 in Version 8 of AJCC's cancer staging manual, breast chapter."
          },
          {
            "code": "cN3a",
            "display": "The concept designated by the symbol cN3a in Version 8 of AJCC's cancer staging manual, breast chapter."
          },
          {
            "code": "cN3b",
            "display": "The concept designated by the symbol cN3b in Version 8 of AJCC's cancer staging manual, breast chapter."
          },
          {
            "code": "cN3c",
            "display": "The concept designated by the symbol cN3c in Version 8 of AJCC's cancer staging manual, breast chapter."
          },
          {
            "code": "pNX",
            "display": "The concept designated by the symbol pNX in Version 8 of AJCC's cancer staging manual, breast chapter."
          },
          {
            "code": "pN0",
            "display": "The concept designated by the symbol pN0 in Version 8 of AJCC's cancer staging manual, breast chapter."
          },
          {
            "code": "pN0_i+",
            "display": "The concept designated by the symbol pN0_i+ in Version 8 of AJCC's cancer staging manual, breast chapter."
          },
          {
            "code": "pN0_mol+",
            "display": "The concept designated by the symbol pN0_mol+ in Version 8 of AJCC's cancer staging manual, breast chapter."
          },
          {
            "code": "pN1",
            "display": "The concept designated by the symbol pN1 in Version 8 of AJCC's cancer staging manual, breast chapter."
          },
          {
            "code": "pN1mi",
            "display": "The concept designated by the symbol pN1mi in Version 8 of AJCC's cancer staging manual, breast chapter."
          },
          {
            "code": "pN1a",
            "display": "The concept designated by the symbol pN1a in Version 8 of AJCC's cancer staging manual, breast chapter."
          },
          {
            "code": "pN1b",
            "display": "The concept designated by the symbol pNb in Version 8 of AJCC's cancer staging manual, breast chapter."
          },
          {
            "code": "pN1c",
            "display": "The concept designated by the symbol pNc in Version 8 of AJCC's cancer staging manual, breast chapter."
          },
          {
            "code": "pN2",
            "display": "The concept designated by the symbol pN2 in Version 8 of AJCC's cancer staging manual, breast chapter."
          },
          {
            "code": "pN2a",
            "display": "The concept designated by the symbol pN2a in Version 8 of AJCC's cancer staging manual, breast chapter."
          },
          {
            "code": "pN2b",
            "display": "The concept designated by the symbol pN2b in Version 8 of AJCC's cancer staging manual, breast chapter."
          },
          {
            "code": "pN3",
            "display": "The concept designated by the symbol pN3 in Version 8 of AJCC's cancer staging manual, breast chapter."
          },
          {
            "code": "pN3a",
            "display": "The concept designated by the symbol pN3a in Version 8 of AJCC's cancer staging manual, breast chapter."
          },
          {
            "code": "pN3b",
            "display": "The concept designated by the symbol pN3b in Version 8 of AJCC's cancer staging manual, breast chapter."
          },
          {
            "code": "pN3c",
            "display": "The concept designated by the symbol pN3c in Version 8 of AJCC's cancer staging manual, breast chapter."
          }
        ]
      }
    ]
  }
}