{
  "resourceType": "ValueSet",
  "id": "cimi-statement-DiagnosticServiceVS",
  "text": {
    "status": "generated",
    "div": "<div xmlns=\"http://www.w3.org/1999/xhtml\">\n<p><b>BC DiagnosticServiceVS ValueSet</b></p>\n<p>The type of laboratory service used in producing a laboratory result. Note -- we may want to include additional descendants of SCT#224891009 (Healthcare services)</p>\n</div>"
  },
  "url": "http://hl7.org/fhir/us/breastcancer/ValueSet/cimi-statement-DiagnosticServiceVS",
  "identifier": [
    {
      "system": "http://hl7.org/fhir/us/breastcancer",
      "value": "cimi.statement.DiagnosticServiceVS"
    }
  ],
  "name": "DiagnosticServiceVS",
  "title": "BC DiagnosticServiceVS ValueSet",
  "status": "draft",
  "publisher": "The HL7 Cancer Interoperability Group sponsored by Clinical Interoperability Council Work Group (CIC)",
  "contact": [
    {
      "telecom": [
        {
          "system": "url",
          "value": "http://www.hl7.org/Special/committees/cic/index.cfm"
        }
      ]
    }
  ],
  "date": "2018-07-30",
  "description": "The type of laboratory service used in producing a laboratory result. Note -- we may want to include additional descendants of SCT#224891009 (Healthcare services)",
  "compose": {
    "include": [
      {
        "system": "http://snomed.info/sct",
        "concept": [
          {
            "code": "310078000",
            "display": "Microbiology service (qualifier) -- Laboratory concerned with cultures, to look for suspected pathogens."
          },
          {
            "code": "706900000",
            "display": "Parasitology service (qualifier) -- Laboratory responsible for examining parasites, feces samples may be examined for evidence of intestinal parasites such as tapeworms or hookworms and others."
          },
          {
            "code": "708185002",
            "display": "Virology service (qualifier) -- Laboratory concerned with identification of viruses in specimens such as blood, urine, and cerebrospinal fluid."
          },
          {
            "code": "708196005",
            "display": "Hematology service (qualifier) -- Laboratory that works with whole blood to do full blood counts, and blood films as well as many other specialised tests."
          },
          {
            "code": "310076001",
            "display": "Biochemistry service (qualifier) -- Laboratory that usually receives serum or plasma and tests the serum for chemicals present in blood."
          },
          {
            "code": "708191000",
            "display": "Toxicology service (qualifier) -- Laboratory that mainly tests for pharmaceutical and recreational drugs. Urine and blood samples are submitted to this lab."
          },
          {
            "code": "708190004",
            "display": "Immunology service (qualifier) -- Immunology/Serology laboratory uses the concept of antigen-antibody interaction as a diagnostic tool. Compatibility of transplanted organs is also determined."
          },
          {
            "code": "310074003",
            "display": "Pathology service (qualifier)-- Surgical, cytopathology, or histopathology laboratory. Surgical pathology examines organs, limbs, tumors, fetuses, and other tissues biopsied in surgery such as breast mastectomies."
          },
          {
            "code": "310048009",
            "display": "Genetics service (procedure) - note: should be in the Snomed (qualifier) hierarchy - Laboratory that mainly performs DNA analysis."
          },
          {
            "code": "708178001",
            "display": "Cytogenetics service (qualifier) -- Laboratory that uses blood and other cells to get a karyotype. This can be helpful in prenatal diagnosis (e.g. Down's syndrome) as well as in cancer (some cancers have abnormal chromosomes)."
          }
        ]
      }
    ]
  }
}